app/views/precatorios/index.html.erb

SELECT `precatorios`.* FROM `precatorios` GROUP BY `precatorios`.`posicao_cronologica`  ORDER BY `precatorios`.`id` ASC
---

<% prec = Precatorio.group(:posicao_cronologica).order(:id)#Precatorio.all