app/controllers/precatorios_controller.rb

  def index
    @precatorios = Precatorio.all
---
SELECT  `precatorios`.* FROM `precatorios`  ORDER BY `precatorios`.`id` DESC LIMIT 1

  def create
    @precatorio = Precatorio.new(precatorio_params)

    respond_to do |format|
      if @precatorio.save
---
INSERT INTO `precatorios` (`created_at`, `updated_at`) VALUES ('2016-02-17 18:26:31', '2016-02-17 18:26:31')

    def set_precatorio
      @precatorio = Precatorio.find(params[:id])
---
SELECT  `precatorios`.* FROM `precatorios` WHERE `precatorios`.`id` = 1 LIMIT 1